[
    {
        "_id": "000000000000000000000000",
        "url": "https://www.google.com",
        "company": "ABC Corp",
        "title": "Software Engineer",
        "location": "San Francisco, CA",
        "department": "Product",
        "employmentType": "full-time",
        "description": "Hello world!"
    },
    {
        "_id": "604177641f5262d4a7884826",
        "url": "https://www.google.com",
        "company": "XYZ Corp",
        "title": "Software Engineer",
        "location": "San Francisco, CA",
        "department": "Product",
        "employmentType": "full-time",
        "description": "Hello world!"
    },
    {
        "_id": "6041993263106fdc15fb414b",
        "url": "",
        "company": "Brilliant",
        "title": "Principal Software Engineer - Backend",
        "location": "San Francisco, CA ",
        "department": "Engineering ",
        "employmentType": "Full-time",
        "description": "About Brilliant Brilliant is a tight-knit team of scientists, educators, engineers, designers, storytellers, and illustrators who are redesigning education at scale.  We believe that math and science are fascinating and beautiful, but that the tools widely used to teach it are dry and ineffective. Brilliant makes learning STEM fun, through problem solving and interactive explorations – from foundational math and science to cutting-edge computer science and professional topics. Brilliant helps over 9 million students, professionals, and lifelong learners around the world cultivate problem solving skills, build intuition, and master concepts rather than memorize them. To understand more about our approach, see our learning principles. You can see all open roles and learn more about our team culture on our Careers page and Engineering page.The RoleWe are a team of fun, motivated, and experienced product and engineering entrepreneurs who are working to make an actual and meaningful impact in the world. Our Backend Engineers are generalists, so not only do they work on the business logic of our main Python & Django codebase, but also on our data pipeline (Python), various internal tools, dashboards, and services (mostly Python, but increasingly Rust), and managing our infrastructure using Ansible. However, for this particular hire, we're open to people that want to be as general or as specialized as they prefer, therefore only the first two of the bullet points listed in the \"Your Responsibilities\" section are required.Your ResponsibilitiesImplementing the backend for new features including design of models, business logic, and views, both by building RESTful APIs for our native apps to consume, as well as working closely with our Frontend Engineers on Django Templated HTML pages.Working with the rest of the Backend team as they rearchitect the business logic layer to better facilitate our Frontend migration to Vue.js, and relatedly, more easily share common business logic between our native APIs and our HTML Frontend.Helping manage our infrastructure: writing and maintaining Ansible configurations, spinning up new servers, migrating databases, resizing our Redshift cluster, mitigating DDoS attacks, and much more.Pitching in to maintain and improve our data pipeline, which is a collection of Python tasks that move, transform, and query data in Kinesis, S3, and Redshift.Build internal tooling to improve workflows across the entire company, from developer efficiency to ops.Who are you?You feel great joy when problem solving (or perhaps after successfully solving a problem). You're able to break a problem down into its component parts, understand it completely, and brainstorm with others on multiple solutions – weighing solutions against each other within the constraints of the system. You can effectively translate a solution from thought to clean, idiomatic code.You've worked professionally for at least eight years as a Backend Engineer. You have used a myriad of programming paradigms, languages, and frameworks. You have architected and led the development of systems with significant complexity and scale, and have overcome novel technical challenges that you are proud to describe to us. You have worked across multiple layers of the stack, and are comfortable solving individual tricky problems at a very low level, as well as stepping back to understand the interactions between all of the moving parts. You put serious effort and thought into engineering team culture, mentorship of other engineers, and team leadership.Our Engineering TeamOur engineers are extraordinary programmers without big egos. We love to share knowledge and support each other. We work together as an interdependent team to accomplish a common goal, and we know how to get things done. We maintain high personal standards, and possess an ongoing, voluntary, and self-motivated pursuit of knowledge.Why join Brilliant? Brilliant has a mission you can get behind. We’re a company that’s helping to bring learners from all over the world together and create a platform on which they can excel, learn, and contribute. We also offer:•   Competitive compensation•   Medical, dental, and vision benefits – we pay 100% of the premiums•   Equipment budget for computer and peripherals•   Free lunch•   Weekly happy hour•   Flexible vacation time•   Fully-stocked pantry and refrigerator with snacks and drinks•   Sponsorship for conferences and professional development•   A stimulating work environment and a chance to change the world  Our CCPA Privacy Notice can be found here.Apply for this job"
    },
    {
        "_id": "604199da91190ce65c5cfae3",
        "url": "",
        "company": "Brilliant",
        "title": "Software Engineer - Frontend",
        "location": "San Francisco, CA ",
        "department": "Engineering ",
        "employmentType": "Full-time",
        "description": "About Brilliant Brilliant is a tight-knit team of scientists, educators, engineers, designers, storytellers, and illustrators who are redesigning education at scale.  We believe that math and science are fascinating and beautiful, but that the tools widely used to teach it are dry and ineffective. Brilliant makes learning STEM fun, through problem solving and interactive explorations – from foundational math and science to cutting-edge computer science and professional topics. Brilliant helps over 9 million students, professionals, and lifelong learners around the world cultivate problem solving skills, build intuition, and master concepts rather than memorize them. To understand more about our approach, see our learning principles. You can see all open roles and learn more about our team culture on our Careers page and Engineering page.The RoleWe are a team of fun, motivated, and experienced product and engineering entrepreneurs who are working to make an actual and meaningful impact in the world. As a Frontend engineer on our team, you'll write TypeScript, Elm, and Django templates. As a senior member of the client team, you'll be helping people across Brilliant teach topics from the basics of arrays to vector calculus in an interactive way.Your ResponsibilitiesBuilding the frontend for new features using Vue.js, TypeScript, and SCSS -- writing clean code and making smart design decisions, all with minimal guidance.Work closely with passionate education experts to grow a suite of tools for expressing concepts in an interactive way – built primarily in Elm. These tools are essential to the future of Brilliant and under rapid development.Refactoring and converting legacy features built with Django templates, JS/ES6, and Less. We're actively working to replace all of our legacy code, so this type of work will gradually decrease.Identifying technical debt and offering recommendations on improving the quality of the frontend codebase.Staying well-informed of new technologies as they come up in the ever-evolving frontend world, and recognizing the difference between a game changing technology and a passing fad.Who are you?You feel great joy when problem solving (or perhaps after successfully solving a problem). You're able to break a problem down into its component parts, understand it completely, and brainstorm with others on multiple solutions – weighing solutions against each other within the constraints of the situation at hand. You can effectively translate a solution from thought to clean, idiomatic code.You've worked professionally for at least one year as a frontend engineer. You're more than comfortable with JavaScript – its quirks, best practices, and why this way is better than that way. A bonus if you are interested in (or already know) TypeScript and Elm. You are familiar with a modern frontend framework like React or Vue. You understand how to write concise and reusable CSS. Lastly, you're proud of how you solved a frontend problem recently, and you're excited to tell us about it.Our Engineering TeamOur engineers are extraordinary programmers without big egos. We love to share knowledge and support each other. We work together as an interdependent team to accomplish a common goal, and we know how to get things done. We maintain high personal standards, and possess an ongoing, voluntary, and self-motivated pursuit of knowledge.Why join Brilliant? Brilliant has a mission you can get behind. We’re a company that’s helping to bring learners from all over the world together and create a platform on which they can excel, learn, and contribute. We also offer:•   Competitive compensation•   Medical, dental, and vision benefits – we pay 100% of the premiums•   Equipment budget for computer and peripherals•   Free lunch•   Weekly happy hour•   Flexible vacation time•   Fully-stocked pantry and refrigerator with snacks and drinks•   Sponsorship for conferences and professional development•   A stimulating work environment and a chance to change the world  Our CCPA Privacy Notice can be found here.Apply for this job"
    },
    {
        "_id": "60419dd3fa85ac61434cbce9",
        "url": "https://jobs.lever.co/wandb/923abe98-500d-4674-91c4-028fa8fdb7cc",
        "company": "Weights & Biases ",
        "title": "Machine Learning Engineer - Intern (Spring/Summer 2021)",
        "location": "San Francisco, CA ",
        "department": "Internships ",
        "employmentType": "Internship",
        "description": "Note: if you have substantial experience in deep learning, you may be interested in our \"Deep Learning Engineer - Intern\" posting instead.At Weights & Biases, our mission is to build the best developer tools for machine learning. We are looking for an intern to support our product integration with various machine learning and data science workflows. You will help develop, test, and showcase new and existing W&B features through a mix of Python scripts, interactive notebooks, custom visualizations, and blog posts. While we have a few specific features and workflows in mind, the datasets and methods will be mostly up to you. We hope to provide an exciting learning opportunity at the intersection of research and development in a fast-moving startup environment. We love building powerful tools together, delighting our users, and supporting the inspiring work of machine learning in research and industry.What you'll achieveIntegrate W&B into various machine learning/data science workflows, using datasets of your choiceExplore and test W&B product features and UI/UX to make sure these workflows are well-supported, making recommendations and improvements when possibleCreate interactive notebook walkthroughs, blog posts, and custom visualizations to document and explain your work(see examples of Google Colabs and Reports in our gallery: https://wandb.ai/gallery, read more about custom visualizations)Gain experience in machine learning and developer toolsDevelop empathy for our users (machine learning practitioners)Partner with developers as they build and ship featuresKeep abreast of competitor products and industry trendsAbout you Undergraduate student with programming experience and interest in machine learningComfortable with Python and writing clean, well-documented codeHave some coursework in machine learning/data science and/or research experience which required writing codeDetail-oriented, excited about finding and resolving edge cases to make the product smoother and more intuitive for our usersPassionate about learning and sharing your insights with teammates and a broad technical audienceSelf-driven and enjoy the fast-paced environment of a startupAbout usMachine learning teams love and rely on our tools for their daily work at companies including OpenAI, Toyota Research Institute, Lyft, Samsung, and Pandora.We have extensive experience working with companies to turn machine learning research projects into scalable, real-world deployments. We’ve watched hundreds of teams struggle to deploy machine learning models successfully, and the same problems show up repeatedly. Machine learning has created a fundamentally new kind of programming, requiring a fundamentally new set of developer tools. We created Weights & Biases to provide that missing toolkit.Here's a quote from Wojciech Zaremba, Cofounder and Robotics Lead, OpenAI: \"W&B allows to scale up insights from a single researcher to the entire team, and from a single machine to hundreds of them.\"Our goal is to mentor you through several projects supporting machine learning tools throughout the summer. The concrete deliverables will include Python scripts, interactive notebook walkthroughs, and blog posts to test, explore, and explain various W&B use cases. Please complete the entire application process by answering the questions below to be considered for this internship. If you have any questions about the role, please email deeplearning@wandb.comWe care about diversity and are seeking people who love to learn and collaborate in an inclusive environment. We are an equal opportunity employer and do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.If you are from an under-represented background, we especially encourage you to apply.Apply for this job"
    }
]